DanielOld/R1/nRF52_SDK_0.9.2_dbc28c9/components/drivers_ext/LSM6DS3/LSM6DS3_ACC_GYRO_driver.c

/******************** (C) COPYRIGHT 2014 STMicroelectronics ********************
* File Name          : LSM6DS3_ACC_GYRO_driver.c
* Author             : MSH Application Team
* Version            : v1.00
* Date               : 09/04/2014 
* Description        : LSM6DS3 ACC_GYRO driver source file
*                      
* HISTORY:
* Date:   09/04/2014            
* Modification: Initial Revision                
* Author:	Platform Independent Driver Generator v0.03
* Reviewed by: Armando Visconti
*-------------------------------------------------------------------------------
*
*
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*
* THIS SOFTWARE IS SPECIFICALLY DESIGNED FOR EXCLUSIVE USE WITH ST PARTS.
*
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "LSM6DS3_ACC_GYRO_driver.h"
#include "twi_master.h"		
#include "nrf_delay.h"
//[Example]

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

static status_t I2C_ByteWrite(u8_t* data, u8_t i2c_addr, u8_t reg)
{
    uint8_t buf[2];

    buf[0] = reg;
    buf[1] = *data;
    if(twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, buf, 2, TWI_ISSUE_STOP))
    {
        return MEMS_SUCCESS;                                                      //[Example]
    }
	else
	{
	    return MEMS_ERROR;
	}
#if 0        

    if(twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, &reg, 1, TWI_DONT_ISSUE_STOP))
    {
        if (twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, data, 1, TWI_ISSUE_STOP))
        {
	        return MEMS_SUCCESS;                                                      //[Example]
        }
		else
		{
		    return MEMS_ERROR;
		}
    }
	else
	{
		return MEMS_ERROR;
	}
#endif	
}

static status_t I2C_BufferWrite(u8_t* data, u8_t i2c_addr, u8_t reg, u16_t len)
{
    if (twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, &reg, 1, TWI_DONT_ISSUE_STOP))
    {
        if (twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, data, len, TWI_ISSUE_STOP))
        {
	        return MEMS_SUCCESS;                                                      //[Example]
        }
		else
		{
		    return MEMS_ERROR;
		}
    }
	else
	{
		return MEMS_ERROR;
	}
}

static status_t I2C_BufferRead(u8_t* data, u8_t i2c_addr, u8_t reg, u16_t len)
{
    if (twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS, &reg, 1, TWI_DONT_ISSUE_STOP))
    {
        if (twi_master_transfer(LSM6DS3_ACC_GYRO_I2C_ADDRESS | TWI_READ_BIT, data, len, TWI_ISSUE_STOP))
        {
	        return MEMS_SUCCESS;                                                      //[Example]
        }
		else
		{
		    return MEMS_ERROR;
		}
    }
	else
	{
		return MEMS_ERROR;
	}
}

static void Delay(u16_t ms)
{
  nrf_delay_ms(ms);
}

/*******************************************************************************
* Function Name		: LSM6DS3_ACC_GYRO_ReadReg
* Description		: Generic Reading function. It must be fullfilled with either
*					: I2C or SPI reading functions					
* Input				: Register Address
* Output			: Data REad
* Return			: None
*******************************************************************************/
u8_t LSM6DS3_ACC_GYRO_ReadReg(u8_t Reg, u8_t* Data) 
{
  
  //To be completed with either I2c or SPI reading function
  //i.e.: *Data = SPI_Mems_Read_Reg( Reg );
  if(!I2C_BufferRead(Data, LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, 1))  //[Example]
	return MEMS_ERROR;                                                        //[Example]
  else                                                                        //[Example]
	return MEMS_SUCCESS;                                                      //[Example]
}

/*******************************************************************************
* Function Name		: LSM6DS3_ACC_GYRO_WriteReg
* Description		: Generic Writing function. It must be fullfilled with either
*					: I2C or SPI writing function
* Input				: Register Address, Data to be written
* Output			: None
* Return			: None
*******************************************************************************/
u8_t LSM6DS3_ACC_GYRO_WriteReg(u8_t Reg, u8_t Data) 
{
    
  //To be completed with either I2c or SPI writing function
  //i.e.: SPI_Mems_Write_Reg(Reg, Data);
  I2C_ByteWrite(&Data,  LSM6DS3_ACC_GYRO_I2C_ADDRESS,  Reg);       //[Example]
  return MEMS_SUCCESS;                                                        //[Example]
}

/*******************************************************************************
* Function Name		: LSM6DS3_ACC_GYRO_WriteMem
* Description		: Generic Writing function. It must be fullfilled with either
*					: I2C or SPI writing function
* Input				: Register Address, ptr to buffer to be written,
*                                 length of buffer
* Output			: None
* Return			: None
*******************************************************************************/
u8_t LSM6DS3_ACC_GYRO_WriteMem(u8_t Reg, u8_t *Bufp, u16_t len)
{
   //u16_t i;
   //u8_t data = 0x0;
  //To be completed with either I2c or SPI writing function
  //i.e.: SPI_Mems_Write_Reg(Reg, Data);
//  I2Cx_Write(Bufp, LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, len);
//  return MEMS_SUCCESS;  
   
     I2C_BufferWrite(Bufp, LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, len);
     return MEMS_SUCCESS;  
  
 /* for (i=0;i<len;i++)
  {
    //set_ram_addr(i);
     data = i & 0xFF;
  I2C_ByteWrite(&data,LSM6DS3_ACC_GYRO_I2C_ADDRESS,LSM6DS3_ACC_GYRO_ADDR0_TO_RW_RAM );
  Delay(2);
  data = (i >> 8) & 0xFF;
  I2C_ByteWrite(&data,LSM6DS3_ACC_GYRO_I2C_ADDRESS,LSM6DS3_ACC_GYRO_ADDR1_TO_RW_RAM);
    
    
    Delay(2);
    I2C_ByteWrite(&Bufp[i],  LSM6DS3_ACC_GYRO_I2C_ADDRESS,  Reg);     
     Delay(2);
  }
   return MEMS_SUCCESS; */     
  //[Example]
}

