DanielOld/R1/nRF52_SDK_0.9.2_dbc28c9/components/drivers_ext/LSM6DS3/LSM6DS3_ACC_GYRO_driver.c
/*******************************************************************************
* Function Name		: LSM6DS3_ACC_GYRO_ReadMem
* Description		: Generic Reading function. It must be fullfilled with either
*					: I2C or SPI writing function
* Input				: Register Address, ptr to buffer to be read,
*                                 length of buffer
* Output			: None
* Return			: None
*******************************************************************************/
u8_t LSM6DS3_ACC_GYRO_ReadMem(u8_t Reg, u8_t *Bufp, u16_t len)
{
   u16_t i; 
    u8_t data = 0x0;
  //To be completed with either I2c or SPI writing function
  //i.e.: SPI_Mems_Write_Reg(Reg, Data);
 // I2Cx_Read(Bufp, LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, len);
 // return MEMS_SUCCESS;                                                        //[Example]
 /*  if(!I2C_BufferRead(Bufp, LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, len))  //[Example]
	return MEMS_ERROR;                                                        //[Example]
  else                                                                        //[Example]
	return MEMS_SUCCESS;   
*/
   
   
  for (i=0;i<len;i++)
  {
  data = i & 0xFF;
  I2C_ByteWrite(&data,LSM6DS3_ACC_GYRO_I2C_ADDRESS,LSM6DS3_ACC_GYRO_ADDR0_TO_RW_RAM );
  Delay(2);
  data = (i >> 8) & 0xFF;
  I2C_ByteWrite(&data,LSM6DS3_ACC_GYRO_I2C_ADDRESS,LSM6DS3_ACC_GYRO_ADDR1_TO_RW_RAM);
    
    if(!I2C_BufferRead(&Bufp[i], LSM6DS3_ACC_GYRO_I2C_ADDRESS, Reg, 1))
    {
      return MEMS_ERROR;   
    }      
    else
    { 
      Delay(2); 
    }
  }
  
 return MEMS_SUCCESS;    

}

/*******************************************************************************
* Function Name		: SwapHighLowByte
* Description		: Swap High/low byte in multiple byte values 
*                     It works with minimum 2 byte for every dimension.
*                     Example x,y,z with 2 byte for every dimension
*
* Input				: bufferToSwap -> buffer to swap 
*                     numberOfByte -> the buffer length in byte
*                     dimension -> number of dimension 
*
* Output			: bufferToSwap -> buffer swapped 
* Return			: None
*******************************************************************************/
void LSM6DS3_ACC_GYRO_SwapHighLowByte(u8_t *bufferToSwap, u8_t numberOfByte, u8_t dimension)
{

  u8_t numberOfByteForDimension, i, j;
  u8_t tempValue[10];
  
  numberOfByteForDimension=numberOfByte/dimension;
  
  for (i=0; i<dimension;i++ )
  {
	for (j=0; j<numberOfByteForDimension;j++ )
		tempValue[j]=bufferToSwap[j+i*numberOfByteForDimension];
	for (j=0; j<numberOfByteForDimension;j++ )
		*(bufferToSwap+i*(numberOfByteForDimension)+j)=*(tempValue+(numberOfByteForDimension-1)-j);
  } 
}

/* Exported functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : LSM6DS3_ACC_GYRO_W_start_prog_ram
* Description    : Write PROG_RAM1
* Input          : LSM6DS3_ACC_GYRO_PROG_RAM1_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM6DS3_ACC_GYRO_W_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_t newValue)
{
  u8_t value;

  if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, &value) )
    return MEMS_ERROR;

  value &= ~LSM6DS3_ACC_GYRO_PROG_RAM1_MASK; 
  value |= newValue;
  
  if( !LSM6DS3_ACC_GYRO_WriteReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, value) )
    return MEMS_ERROR;

  return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM6DS3_ACC_GYRO_R_start_prog_ram
* Description    : Read PROG_RAM1
* Input          : Pointer to LSM6DS3_ACC_GYRO_PROG_RAM1_t
* Output         : Status of PROG_RAM1 see LSM6DS3_ACC_GYRO_PROG_RAM1_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM6DS3_ACC_GYRO_R_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_t *value)
{
 if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, (u8_t *)value) )
    return MEMS_ERROR;

  *value &= LSM6DS3_ACC_GYRO_PROG_RAM1_MASK; //mask

  return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM6DS3_ACC_GYRO_W_start_customrom
* Description    : Write CUSTOMROM1
* Input          : LSM6DS3_ACC_GYRO_CUSTOMROM1_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM6DS3_ACC_GYRO_W_start_customrom(LSM6DS3_ACC_GYRO_CUSTOMROM1_t newValue)
{
  u8_t value;

  if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, &value) )
    return MEMS_ERROR;

  value &= ~LSM6DS3_ACC_GYRO_CUSTOMROM1_MASK; 
  value |= newValue;
  
  if( !LSM6DS3_ACC_GYRO_WriteReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, value) )
    return MEMS_ERROR;

  return MEMS_SUCCESS;
}

/*******************************************************************************
* Function Name  : LSM6DS3_ACC_GYRO_R_start_customrom
* Description    : Read CUSTOMROM1
* Input          : Pointer to LSM6DS3_ACC_GYRO_CUSTOMROM1_t
* Output         : Status of CUSTOMROM1 see LSM6DS3_ACC_GYRO_CUSTOMROM1_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/

status_t LSM6DS3_ACC_GYRO_R_start_customrom(LSM6DS3_ACC_GYRO_CUSTOMROM1_t *value)
{
 if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_RAM_ACCESS, (u8_t *)value) )
    return MEMS_ERROR;

  *value &= LSM6DS3_ACC_GYRO_CUSTOMROM1_MASK; //mask

  return MEMS_SUCCESS;
}
/*******************************************************************************
* Function Name  : LSM6DS3_ACC_GYRO_W_Open_RAM_Page
* Description    : Write RAM_PAGE
* Input          : LSM6DS3_ACC_GYRO_RAM_PAGE_t
* Output         : None
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t  LSM6DS3_ACC_GYRO_W_Open_RAM_Page(LSM6DS3_ACC_GYRO_RAM_PAGE_t newValue)
{
  u8_t value;

