DanielOld/R1/nRF52_SDK_0.9.2_dbc28c9/components/drivers_ext/LSM6DS3/LSM6DS3_ACC_GYRO_driver.c
  numberOfByteForDimension=6/3;

  k=0;
  for (i=0; i<3;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_OUTX_L_G+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetAccData(u8_t *buff)
* Description    : Read GetAccData output register
* Input          : pointer to [u8_t]
* Output         : GetAccData buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetAccData(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=6/3;

  k=0;
  for (i=0; i<3;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_OUTX_L_XL+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetSnsr3Data(u8_t *buff)
* Description    : Read GetSnsr3Data output register
* Input          : pointer to [u8_t]
* Output         : GetSnsr3Data buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetSnsr3Data(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=6/3;

  k=0;
  for (i=0; i<3;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_SENSORHUB1_REG+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetSnsr4Data(u8_t *buff)
* Description    : Read GetSnsr4Data output register
* Input          : pointer to [u8_t]
* Output         : GetSnsr4Data buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetSnsr4Data(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=6/3;

  k=0;
  for (i=0; i<3;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_SENSORHUB7_REG+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetFIFOData(u8_t *buff)
* Description    : Read GetFIFOData output register
* Input          : pointer to [u8_t]
* Output         : GetFIFOData buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetFIFOData(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=2/1;

  k=0;
  for (i=0; i<1;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_FIFO_DATA_OUT_L+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetTimestamp(u8_t *buff)
* Description    : Read GetTimestamp output register
* Input          : pointer to [u8_t]
* Output         : GetTimestamp buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetTimestamp(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=3/1;

  k=0;
  for (i=0; i<1;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_TIMESTAMP0_REG+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/*******************************************************************************
* Function Name  : status_t LSM6DS3_ACC_GYRO_Get_GetStepCounter(u8_t *buff)
* Description    : Read GetStepCounter output register
* Input          : pointer to [u8_t]
* Output         : GetStepCounter buffer u8_t
* Return         : Status [MEMS_ERROR, MEMS_SUCCESS]
*******************************************************************************/
status_t LSM6DS3_ACC_GYRO_Get_GetStepCounter(u8_t *buff) 
{
  u8_t i, j, k;
  u8_t numberOfByteForDimension;
  
  numberOfByteForDimension=2/1;

  k=0;
  for (i=0; i<1;i++ ) 
  {
	for (j=0; j<numberOfByteForDimension;j++ )
	{	
		if( !LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_STEP_COUNTER_L+k, &buff[k]))
		  return MEMS_ERROR;
		k++;	
	}
  }

  return MEMS_SUCCESS; 
}

/************** Access Device RAM  *******************/
/* Set the RAM address */
static inline void set_ram_addr(u16_t addr)
{
  u8_t data = 0x0;

  data = addr & 0xFF;
  LSM6DS3_ACC_GYRO_WriteReg(LSM6DS3_ACC_GYRO_ADDR0_TO_RW_RAM, data);

  data = (addr >> 8) & 0xFF;
  LSM6DS3_ACC_GYRO_WriteReg(LSM6DS3_ACC_GYRO_ADDR1_TO_RW_RAM, data);
}

/* write program to ram */
static void program_ram_wr(u8_t *code_bufp, u16_t addr, u16_t len)
{
  /* Enable RAM Access */
  LSM6DS3_ACC_GYRO_W_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_ENABLED);

  /* Set RAM Address */
  set_ram_addr(addr);
  
  /* Write program to RAM (multiple writes) */
  LSM6DS3_ACC_GYRO_WriteMem(LSM6DS3_ACC_GYRO_DATA_TO_WR_RAM, code_bufp, len);

  /* Disable RAM Access */
  LSM6DS3_ACC_GYRO_W_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_DISABLED);
}
#if 0
/* read program from ram */
static void program_ram_rd(u8_t *code_bufp, u16_t addr, u16_t len)
{
  /* Enable RAM Access */
  LSM6DS3_ACC_GYRO_W_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_ENABLED);

  /* Set RAM Address */
  set_ram_addr(addr);
  
  /* Read program from RAM (multiple reads) */
  LSM6DS3_ACC_GYRO_ReadMem(LSM6DS3_ACC_GYRO_DATA_RD_FROM_RAM, code_bufp, len);

