DanielOld/R1/nRF52_SDK_0.9.2_dbc28c9/components/drivers_ext/LSM6DS3/LSM6DS3_ACC_GYRO_driver.c
  /* Disable RAM Access */
  LSM6DS3_ACC_GYRO_W_start_prog_ram(LSM6DS3_ACC_GYRO_PROG_RAM1_DISABLED);
}
#endif
uint8_t ram_tmp[LSM6DS3_ACC_GYRO_RAM_SIZE];

/* Init RAM */
status_t LSM6DS3_ACC_GYRO_init_RAM(u8_t *code_bufp)
{
  //u16_t i;

  /* Force device to exec from ROM */
  LSM6DS3_ACC_GYRO_W_start_customrom(LSM6DS3_ACC_GYRO_CUSTOMROM1_DISABLED);

  /* program the RAM with code */
  program_ram_wr(code_bufp, 0x0, LSM6DS3_ACC_GYRO_RAM_SIZE);

  /* Read back and verify */
/*  program_ram_rd(ram_tmp, 0x0, LSM6DS3_ACC_GYRO_RAM_SIZE);
  for (i = 0; i < LSM6DS3_ACC_GYRO_RAM_SIZE; i++) {
    if (code_bufp[i] != ram_tmp[i])
      while(1);
  }*/

  /* Enable device to exec from RAM */
  LSM6DS3_ACC_GYRO_W_start_customrom(LSM6DS3_ACC_GYRO_CUSTOMROM1_ENABLED);

  return MEMS_SUCCESS; 
}

/************** Program Pedometer Threshold  *******************/
status_t  LSM6DS3_ACC_GYRO_W_PedoThreshold(u8_t newValue)
{
  u8_t value;

  /* Open Embedded Function Register page*/
  LSM6DS3_ACC_GYRO_W_Open_RAM_Page(LSM6DS3_ACC_GYRO_RAM_PAGE_ENABLED);

  /* read current value */
  LSM6DS3_ACC_GYRO_ReadReg(LSM6DS3_ACC_GYRO_CONFIG_PEDO_THS_MIN, &value);

  value &= ~0x1F; 
  value |= (newValue & 0x1F);
  
  /* write new value */
  LSM6DS3_ACC_GYRO_WriteReg(LSM6DS3_ACC_GYRO_CONFIG_PEDO_THS_MIN, value);
  
  
  // value &= ~0x1F; 
  //value |= (newValue & 0x1F);
  
  /* write new value */ //debouncing 
  LSM6DS3_ACC_GYRO_WriteReg(0x14, 0xe6); //0xe6-->0x6e

  /* Close Embedded Function Register page*/
  LSM6DS3_ACC_GYRO_W_Open_RAM_Page(LSM6DS3_ACC_GYRO_RAM_PAGE_DISABLED);

  return MEMS_SUCCESS;
}
